interface DistrictZone {
  districtGroup: string;
  districts: string[];
}

export const data: DistrictZone[] = [
  {
    districtGroup: 'กรุงเทพกลาง',
    districts: [
      'ป้อมปราบศัตรูพ่าย',
      'วังทองหลาง',
      'สัมพันธวงศ์',
      'พญาไท',
      'ดินแดง',
      'ดุสิต',
      'พระนคร',
      'ห้วยขวาง',
      'ราชเทวี',
    ],
  },
  {
    districtGroup: 'กรุงเทพเหนือ',
    districts: [
      'สายไหม',
      'จตุจักร',
      'หลักสี่',
      'ดอนเมือง',
      'บางซื่อ',
      'ลาดพร้าว',
      'บางเขน',
    ],
  },
  {
    districtGroup: 'กรุงเทพตะวันออก',
    districts: [
      'สะพานสูง',
      'หนองจอก',
      'บางกะปิ',
      'ประเวศ',
      'ลาดกระบัง',
      'บึงกุ่ม',
      'คันนายาว',
      'มีนบุรี',
      'คลองสามวา',
    ],
  },
  {
    districtGroup: 'กรุงเทพใต้',
    districts: [
      'วัฒนา',
      'สวนหลวง',
      'พระโขนง',
      'สาทร',
      'คลองเตย',
      'บางคอแหลม',
      'ปทุมวัน',
      'บางรัก',
      'ยานนาวา',
      'บางนา',
    ],
  },
  {
    districtGroup: 'กรุงธนเหนือ',
    districts: [
      'บางพลัด',
      'บางกอกน้อย',
      'บางกอกใหญ่',
      'ตลิ่งชัน',
      'ทวีวัฒนา',
      'จอมทอง',
      'ธนบุรี',
      'คลองสาน',
    ],
  },
  {
    districtGroup: 'กรุงธนใต้',
    districts: [
      'บางขุนเทียน',
      'บางแค',
      'หนองแขม',
      'ภาษีเจริญ',
      'บางบอน',
      'ทุ่งครุ',
      'ราษฎร์บูรณะ',
    ],
  },
];
