package constant

var SchoolReportCsvHeader = []string{"No", "รหัสโรงเรียน", "รหัสย่อโรงเรียน", "จำนวนห้องเรียน", "จำนวนนักเรียน", "ด่านที่ผ่าน", "คะแนนรวม", "ทำข้อสอบ (ครั้ง)", "เวลาเฉลี่ย / ข้อ (วินาที)"}
var ClassReportCsvHeader = []string{"No", "ปีการศึกษา", "ระดับชั้น", "ห้อง", "จำนวนนักเรียน (คน)", "จำนวนนักเรียนที่เข้าใช้งานจริง", "ด่านที่ผ่าน", "คะแนนรวม", "ค่าเฉลี่ยจำนวนแบบฝึกหัดที่ทำ", "ทำข้อสอบ (ครั้ง)", "เวลาเฉลี่ย / ข้อ (วินาที)"}
var StudentReportCsvHeader = []string{"No", "รหัสนักเรียน", "คำนำหน้า", "ชื่อ", "นามสกุล", "ด่านที่ผ่าน (ด่าน)", "คะแนนรวม (คะแนน)", "ทำข้อสอบ (ครั้ง)", "เวลาเฉลี่ย/ข้อ (วินาที)", "เข้าสู่ระบบล่าสุด"}
var LessonReportCsvHeader = []string{"No", "สังกัดวิชา", "วิชา", "บทเรียนหลัก", "ด่านที่ผ่าน (ด่าน)", "คะแนนรวม (คะแนน)", "ทำข้อสอบ (ครั้ง)", "เวลาเฉลี่ย/ข้อ (วินาที)", "เข้าสู่ระบบล่าสุด"}
var SubLessonReportCsvHeader = []string{"No", "บทเรียนย่อย", "ด่านที่ผ่านเฉลี่ย (ด่าน)", "คะแนนรวมเฉลี่ย (คะแนน)", "ทำข้อสอบ (ครั้ง)", "เวลาเฉลี่ย/ข้อ (วิยาที)", "ทำข้อสอบล่าสุด"}
var LevelReportCsvHeader = []string{"No", "ด่านที่", "ประเภท", "รูปแบบคำถาม", "ระดับ", "คะแนนรวมเฉลี่ย", "ทำข้อสอบ (ครั้ง)", "เวลาเฉลี่ย/ข้อ (วินาที)", "ทำข้อสอบล่าสุด"}
var LevelPlayLogCsvHeader = []string{"No", "ทำครั้งที่", "คะแนน", "เวลา/ข้อ (วินาที)", "เวลาทำข้อสอบ"}

var LevelTypeMap = map[string]string{
	"test":                 "แบบฝึกหัด",
	"pre-post-test":        "แบบฝึกหัดก่อนเรียน",
	"sub-lesson-post-test": "แบบฝึกหัดท้ายบทเรียนย่อย",
}

var LevelDifficultyMap = map[string]string{
	"easy":   "ง่าย",
	"medium": "ปานกลาง",
	"hard":   "ยาก",
}
