package constant

var StudentListCsvHeader = []string{"#", "รหัสนักเรียน/รหัสผู้ใช้งาน", "คำนำหน้า", "ชื่อ", "สกุล", "อีเมล", "เข้าใช้งานล่าสุด"}

var LessonStatCsvHeader = []string{"#", "รหัสนักเรียน/รหัสผู้ใช้งาน", "คำนำหน้า", "ชื่อ", "สกุล", "ปีการศึกษา", "ชั้นปี", "ห้อง", "ด่านที่ผ่าน (ด่าน)", "คะแนนรวม (คะแนน)", "ทำข้อสอบ (ครั้ง)", "เวลาเฉลี่ย/ข้อ (วินาที)", "เข้าสู่ระบบล่าสุด"}

var StudentAcademicYearCsvHeader = []string{"#", "ปีการศึกษา", "ชั้นปี", "ห้อง", "สังกััดวิชา", "วิชา", "บทเรียนหลัก", "ด่านที่ผ่าน (ด่าน)", "คะแนนรวม (คะแนน)", "ทำข้อสอบ (ครั้ง)", "เวลาเฉลี่ย/ข้อ (วินาที)", "เข้าสู่ระบบล่าสุด"}

var StudentLessonCsvHeader = []string{"#", "บทเรียนย่อย", "ด่านที่", "ด่านที่ผ่านเฉลี่ย (ด่าน)", "คะแนนรวมเฉลี่ย (คะแนน)", "ทำข้อสอบโดยเฉลี่ย (ครั้ง)", "เวลาเฉลี่ย/ข้อ (วินาที)", "ทำข้อสอบล่าสุด"}

var StudentSubLessonCsvHeader = []string{"#", "ด่านที่", "ประเภท", "รูปแบบคำถาม", "ระดับ", "คะแนนรวมเฉลี่ย (คะแนน)", "ทำข้อสอบแล้ว (ครั้ง)", "เวลาเฉลี่ย/ข้อ (วินาที)", "ทำข้อสอบล่าสุด"}

var StudentLevelCsvHeader = []string{"#", "ทำครั้งที่", "คะแนน", "เวลา/ข้อ (วินาที)", "เวลาทำข้อสอบ"}

var StudentRewardCsvHeader = []string{"#", "รหัสไอเทม", "ประเภท", "รูปภาพ", "ชื่อรางวัล", "คำอธิบาย", "จำนวน", "ได้รับจาก", "ได้รับเมื่อ", "ใช้งานเมื่อ"}

var StudyGroupCsvHeader = []string{"#", "ชื่อกลุ่มเรียน"}
