export const yearOptions = [
  { value: 1, label: 'ชั้นปีที่ 1' },
  { value: 2, label: 'ชั้นปีที่ 2' },
  { value: 3, label: 'ชั้นปีที่ 3' },
  { value: 4, label: 'ชั้นปีที่ 4' },
  { value: 5, label: 'ชั้นปีที่ 5' },
  { value: 6, label: 'ชั้นปีที่ 6' },
];
export const statusOptions = [
  { value: 'enabled', label: 'ใช้งาน' },
  { value: 'disabled', label: 'ไม่ใช้งาน' },
  { value: 'draft', label: 'แบบร่าง' },
];
export const groupLearningcontentOptions = [
  { value: 'คณิศาสตร์', label: 'คณิศาสตร์' },
  { value: 'วิทยาศาสตร์', label: 'วิทยาศาสตร์' },
  { value: 'อังกฤษ', label: 'อังกฤษ' },
  { value: 'จีน', label: 'จีน' },
];

export const contentOptions = [
  { value: 'year0', label: 'นำนวนและพีชคณิต' },
  {
    value: 'year1',
    label:
      'อ่านและเขียนตัวเลขฮินดูอารบิก ตัวเลขไทย และตัวหนังสือแสดงจำนวนนับที่มากกว่า ๑๐๐,๐๐๐',
  },
  {
    value: 'year2',
    label: 'เปรียบเทียบและเรียงลำดับจำนวนนับที่มากกว่า ๑๐๐,๐๐๐ จากสถานการณ์ต่าง ๆ',
  },
  {
    value: 'year3',
    label:
      'อธิบาย อ่าน และเขียน เศษส่วนจำนวนคละแสดงปริมาณสิ่งต่างๆ และแสดงสิ่งต่าง ๆ ตามเศษส่วน จำนวนคละที่กำหนด',
  },
];
export const standardOptions = [
  {
    value: 'year1',
    label:
      'เข้าใจความหลากหลายของการแสดงจำนวน ระบบจำนวน การดำเนินการของจำนวน ผลที่เกิดขึ้นจากการดำเนินการ สมบัติของการดำเนินการ และนำไปใช้',
  },
  {
    value: 'year2',
    label:
      'เข้าใจความหลากหลายของการแสดงจำนวน ระบบจำนวน การดำเนินการของจำนวน ผลที่เกิดขึ้นจากการดำเนินการ สมบัติของการดำเนินการ และนำไปใช้',
  },
  {
    value: 'year3',
    label:
      'เข้าใจความหลากหลายของการแสดงจำนวน ระบบจำนวน การดำเนินการของจำนวน ผลที่เกิดขึ้นจากการดำเนินการ สมบัติของการดำเนินการ และนำไปใช้',
  },
  {
    value: 'year4',
    label:
      'เข้าใจความหลากหลายของการแสดงจำนวน ระบบจำนวน การดำเนินการของจำนวน ผลที่เกิดขึ้นจากการดำเนินการ สมบัติของการดำเนินการ และนำไปใช้',
  },
];

export const learningContectOptions = [
  { value: 'year1', label: 'จำนวนนับที่มากกว่า ๑๐๐,๐๐๐' },
  { value: 'year2', label: 'เศษส่วน' },
  { value: 'year3', label: 'ทศนิยม' },
  {
    value: 'year4',
    label: 'การบวก การลบ การคูณ การหารจำนวนนับที่มากกว่า ๑๐๐,๐๐๐',
  },
];
export const inducatorOptions = [
  {
    value: 'year1',
    label:
      'อ่านและเขียนตัวเลขฮินดูอารบิก ตัวเลขไทย และตัวหนังสือแสดงจำนวนนับที่มากกว่า ๑๐๐,๐๐๐',
  },
  {
    value: 'year1',
    label:
      'อ่านและเขียนตัวเลขฮินดูอารบิก ตัวเลขไทย และตัวหนังสือแสดงจำนวนนับที่มากกว่า ๑๐๐,๐๐๐',
  },
  {
    value: 'year1',
    label:
      'อ่านและเขียนตัวเลขฮินดูอารบิก ตัวเลขไทย และตัวหนังสือแสดงจำนวนนับที่มากกว่า ๑๐๐,๐๐๐',
  },
  {
    value: 'year1',
    label:
      'อ่านและเขียนตัวเลขฮินดูอารบิก ตัวเลขไทย และตัวหนังสือแสดงจำนวนนับที่มากกว่า ๑๐๐,๐๐๐',
  },
];

export const subjectOption = [
  { value: 'คณิศาสตร์', label: 'คณิศาสตร์' },
  { value: 'วิทยาศาสตร์', label: 'วิทยาศาสตร์' },
  { value: 'อังกฤษ', label: 'อังกฤษ' },
  { value: 'จีน', label: 'จีน' },
];
