package constant

var True = true
var False = false

var StudentInformationCSVHeader = []string{"รหัสโรงเรียน", "ชื่อโรงเรียน", "เลขประจำตัวประชาชน", "ชั้น", "ห้อง", "รหัสนักเรียน", "เพศ", "คำนำหน้าชื่อ", "ชื่อ", "นามสกุล", "วันเกิด", "เชื้อชาติ", "สัญชาติ", "ศาสนา", "สถานภาพสมรสของบิดามารดา", "คำนำหน้าชื่อบิดา", "ชื่อบิดา", "นามสกุลบิดา", "คำนำหน้าชื่อมารดา", "ชื่อมารดา", "นามสกุลมารดา", "ความเกี่ยวข้องของผู้ปกครองกับนักเรียน", "คำนำหน้าชื่อผู้ปกครอง", "ชื่อผู้ปกครอง", "นามสกุลผู้ปกครอง", "เลขที่บ้าน (ทะเบียนบ้าน)", "หมู่ (ทะเบียนบ้าน)", "ตำบล (ทะเบียนบ้าน)", "อำเภอ (ทะเบียนบ้าน)", "จังหวัด (ทะเบียนบ้าน)", "รหัสไปรษณีย์ (ทะเบียนบ้าน)"}
