package constant

var GroupLessonStatCsvHeader = []string{"#", "สังกััดวิชา", "วิชา", "บทเรียน", "ด่านที่ผ่านเฉลี่ย (ด่าน)", "คะแนนรวมเฉลี่ย (คะแนน)", "ทำข้อสอบโดยเฉลี่ย (ครั้ง)", "เวลาเฉลี่ย/ข้อ (วินาที)", "ทำข้อสอบล่าสุด"}

var GroupSubLessonStatCsvHeader = []string{"#", "บทเรียนย่อย", "ด่านที่", "ด่านที่ผ่านเฉลี่ย (ด่าน)", "คะแนนรวมเฉลี่ย (คะแนน)", "ทำข้อสอบโดยเฉลี่ย (ครั้ง)", "เวลาเฉลี่ย/ข้อ (วินาที)", "ทำข้อสอบล่าสุด"}

var GroupLevelStatCsvHeader = []string{"#", "ด่านที่", "ประเภท", "รูปแบบคำถาม", "ระดับ", "คะแนนรวมเฉลี่ย (คะแนน)", "ทำข้อสอบแล้ว (คน)", "ทำข้อสอบโดยเเฉลี่ย (ครั้ง)", "ทำข้อสอบแล้ว (ครั้ง)", "เวลาเฉลี่ย/ข้อ (วินาที)", "ทำข้อสอบล่าสุด"}

var GroupPlayLogStatCsvHeader = []string{"#", "รหัสนักเรียน", "คำนำหน้า", "ชื่อ", "สกุล", "ด่านที่ผ่าน (ด่าน)", "คะแนนรวม (คะแนน)", "ทำข้อสอบ (ครั้ง)", "เวลาเฉลี่ย/ข้อ (วินาที)", "เข้าสู่ระบบล่าสุด"}
