package constant

var (
	BestSchoolListByAvgClassStarsCsvHeader    = []string{"ชื่อโรงเรียน", "จำนวนห้องเรียน", "จำนวนครู", "จำนวนนักเรียน", "ค่าเฉลี่ยคะแนนสูงสุด", "จำนวนห้องเรียนที่ใช้งาน", "จำนวนนักเรียนที่ใช้งาน"}
	BestStudentListCsvHeader                  = []string{"ชื่อโรงเรียน", "ชื่อนักเรียน", "ชั้นปี", "ห้อง", "จำนวนดาว"}
	BestStudentListLevelCsvHeader             = []string{"ชื่อโรงเรียน", "ชื่อนักเรียน", "ชั้นปี", "ห้อง", "จำนวนด่าน"}
	BestTeacherListByClassStarsCsvHeader      = []string{"ชื่อโรงเรียน", "ชื่อครู", "ชั้นปี", "ห้อง", "จำนวนนักเรียน", "จำนวนดาว", "จำนวนด่าน"}
	BestTeacherListByHomeworkCsvHeader        = []string{"ชื่อโรงเรียน", "คำนำหน้าครู", "ชื่อครู", "นามสกุลครู", "สั่งการบ้านรวม (ครั้ง)", "จำนวนสัปดาห์ที่สั่งการบ้าน", "การใช้งานล่าสุด"}
	BestTeacherListByLessonCsvHeader          = []string{"ชื่อโรงเรียน", "ปีการศึกษา", "ชั้นปี", "ห้อง", "สังกัดวิขา", "บทเรียนหลัก", "บทเรียนย่อย", "คะแนนรวมโดยเฉลี่ย (ดาว)", "ด่านที่ผ่านโดยเฉลี่ย", "ทําแบบฝึกหัด (ครั้ง)", "เวลาเฉลี่ยต่อข้อ"}
	BestTeacherListByStudyGroupStarsCsvHeader = []string{"ชื่อโรงเรียน", "ปีการศึกษา", "ชั้นปี", "ห้อง", "ชื่อกลุ่มเรียน", "จํานวนนักเรียน", "คะแนนรวมโดยเฉลี่ย (ดาว)", "ด่านที่ผ่านโดยเฉลี่ย", "ทําแบบฝึกหัด (ครั้ง)", "เวลาเฉลี่ยต่อข้อ"}
)
