package constant

var SchoolAffiliationCsvHeader = []string{"No", "Id (ห้ามแก้)", "กลุ่มสังกัดโรงเรียน (สนศ. กทม. / สพฐ / อปท / สช / อื่นๆ)", "ประเภท (รัฐ / เอกชน)", "ชื่อ", "ตัวย่อ", "สถานะ (enabled / disabled / draft)", "กลุ่มเขต (สำหรับ สนศ.กทม.)", "เขต (สำหรับ สนศ.กทม.)", "เขตตรวจราชการ (สำหรับ สพฐ)", "สำนักงานเขตพื้นที่ (สำหรับ สพฐ)", "ประเภท อปท (สำหรับ อปท, อบต/อบจ/เทศบาลนคร/เทศบาลตำบล/เทศบาลอำเภอ)", "อำเภอ (สำหรับ อปท)", "ตำบล (สำหรับ อปท)", "จังหวัด (สำหรับ อปท)"}
var CurriculumGroupCsvHeader = []string{"No", "Id (ห้ามแก้)", "ชื่อสังกัดวิชา", "ชื่อย่อ", "สถานะ"}
var ContentCreatorCsvHeader = []string{"No", "Id (ห้ามแก้)", "คำนำหน้า", "ชื่อ", "นามสกุล", "อีเมล"}
var SeedYearCsvHeader = []string{"No", "Id (ห้ามแก้)", "ชื่อชั้นปี", "ชื่อย่อ"}
var ContractCsvHeader = []string{"No", "รหัสสัญญา", "ชื่อสัญญา", "จำนวนโรงเรียน", "วันที่เริ่มต้นสัญญา", "วันที่สิ้นสุดสัญญา", "แก้ไขล่าสุด", "แก้ไขล่าสุดโดย", "สถานะ"}
